FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
/**********************************************************************
* $Id$		lpc43xx_i2c.c		2011-06-02
*//**
* @file		lpc43xx_i2c.c
* @brief	Contains all functions support for I2C firmware library
*           on lpc43xx
* @version	1.0
* @date		02. June. 2011
* @author	NXP MCU SW Application Team
*
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */

/** @addtogroup I2C
 * @{
 */

/* Includes ------------------------------------------------------------------- */
#include "lpc43xx_i2c.h"
#include "lpc43xx_cgu.h"
#include "scu.h"

#define MD_EZI    ( 0x1 << 6 )
#define MD_ZI     ( 0x1 << 7 )

/* If this source file built with example, the lpc43xx FW library configuration
 * file in each example directory ("lpc43xx_libcfg.h") must be included,
 * otherwise the default FW library configuration file must be included instead
 */
#ifdef __BUILD_WITH_EXAMPLE__
    #include "lpc43xx_libcfg.h"
#else
    #include "lpc43xx_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */


#ifdef _I2C


/* Private Types -------------------------------------------------------------- */

/** @defgroup I2C_Private_Types I2C Private Types
 * @{
 */
    #define SFSP2_3_CONFIGURE_I2C1_SDA                   ( 0x00000001 | MD_ZI | MD_EZI )
    #define SFSP2_4_CONFIGURE_I2C1_SCL                   ( 0x00000001 | MD_ZI | MD_EZI )
    #define SFSI2C0_CONFIGURE_STANDARD_FAST_MODE         ( 1 << 3 | 1 << 11 )
    #define SFSI2C0_CONFIGURE_FASTPLUS_HIGHSPEED_MODE    ( 2 << 1 | 1 << 3 | 1 << 7 | 1 << 10 | 1 << 11 )

/**
 * @brief I2C device configuration structure type
 */
    typedef struct
    {
        uint32_t txrx_setup;                        /* Transmission setup */
        int32_t dir;                                /* Current direction phase, 0 - write, 1 - read */
    } I2C_CFG_T;

/**
 * @}
 */

/* Private Variables ---------------------------------------------------------- */

/**
 * @brief II2C driver data for I2C0, I2C1
 */
    static I2C_CFG_T i2cdat[ 3 ];

    static uint32_t I2C_MasterComplete[ 3 ];
    static uint32_t I2C_SlaveComplete[ 3 ];

    static uint32_t I2C_MonitorBufferIndex;

/* Private Functions ---------------------------------------------------------- */

/* Get I2C number */
    static int32_t I2C_getNum( LPC_I2Cn_Type * I2Cx );

/* Generate a start condition on I2C bus (in master mode only) */
    static uint32_t I2C_Start( LPC_I2Cn_Type * I2Cx );

/* Generate a stop condition on I2C bus (in master mode only) */
    static void I2C_Stop( LPC_I2Cn_Type * I2Cx );

/* I2C send byte subroutine */
    static uint32_t I2C_SendByte( LPC_I2Cn_Type * I2Cx,
                                  uint8_t databyte );

/* I2C get byte subroutine */
    static uint32_t I2C_GetByte( LPC_I2Cn_Type * I2Cx,
                                 uint8_t * retdat,
                                 Bool ack );

/*--------------------------------------------------------------------------------*/

/********************************************************************//**
 * @brief		Convert from I2C peripheral to number
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      I2C number or error code, could be:
 *                  - 0		:I2C0
 *                  - 1		:I2C1
 *                  - (-1)	:Error
 *********************************************************************/
    static int32_t I2C_getNum( LPC_I2Cn_Type * I2Cx )
    {
        if( I2Cx == LPC_I2C0 )
        {
            return( 0 );
        }
        else if( I2Cx == LPC_I2C1 )
        {
            return( 1 );
        }

        return( -1 );
    }


/********************************************************************//**
 * @brief		Generate a start condition on I2C bus (in master mode only)
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      value of I2C status register after generate a start condition
 *********************************************************************/
    static uint32_t I2C_Start( LPC_I2Cn_Type * I2Cx )
    {
        I2Cx->CONSET = I2C_I2CONSET_STA;
        I2Cx->CONCLR = I2C_I2CONCLR_SIC;

        /* Wait for complete */
        while( !( I2Cx->CONSET & I2C_I2CONSET_SI ) )
        {
        }

        I2Cx->CONCLR = I2C_I2CONCLR_STAC;
        return( I2Cx->STAT & I2C_STAT_CODE_BITMASK );
    }


/********************************************************************//**
 * @brief		Generate a stop condition on I2C bus (in master mode only)
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      None
 *********************************************************************/
    static void I2C_Stop( LPC_I2Cn_Type * I2Cx )
    {
        /* Make sure start bit is not active */
        if( I2Cx->CONSET & I2C_I2CONSET_STA )
        {
            I2Cx->CONCLR = I2C_I2CONCLR_STAC;
        }

        I2Cx->CONSET = I2C_I2CONSET_STO;
        I2Cx->CONCLR = I2C_I2CONCLR_SIC;
    }


