FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
/********************************************************************//**
 * @brief		Send a byte
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	databyte	sent data
 * @return      value of I2C status register after sending
 *********************************************************************/
    static uint32_t I2C_SendByte( LPC_I2Cn_Type * I2Cx,
                                  uint8_t databyte )
    {
        /* Make sure start bit is not active */
        if( I2Cx->CONSET & I2C_I2CONSET_STA )
        {
            I2Cx->CONCLR = I2C_I2CONCLR_STAC;
        }

        I2Cx->DAT = databyte & I2C_I2DAT_BITMASK;
        I2Cx->CONCLR = I2C_I2CONCLR_SIC;

        while( !( I2Cx->CONSET & I2C_I2CONSET_SI ) )
        {
        }

        return( I2Cx->STAT & I2C_STAT_CODE_BITMASK );
    }


/********************************************************************//**
 * @brief		Get a byte
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[out]	retdat	pointer to return data
 * @param[in]	ack		assert acknowledge or not, should be: TRUE/FALSE
 * @return      value of I2C status register after sending
 *********************************************************************/
    static uint32_t I2C_GetByte( LPC_I2Cn_Type * I2Cx,
                                 uint8_t * retdat,
                                 Bool ack )
    {
        if( ack == TRUE )
        {
            I2Cx->CONSET = I2C_I2CONSET_AA;
        }
        else
        {
            I2Cx->CONCLR = I2C_I2CONCLR_AAC;
        }

        I2Cx->CONCLR = I2C_I2CONCLR_SIC;

        while( !( I2Cx->CONSET & I2C_I2CONSET_SI ) )
        {
        }

        *retdat = ( uint8_t ) ( I2Cx->DAT & I2C_I2DAT_BITMASK );
        return( I2Cx->STAT & I2C_STAT_CODE_BITMASK );
    }

/* End of Private Functions --------------------------------------------------- */


/* Public Functions ----------------------------------------------------------- */

/** @addtogroup I2C_Public_Functions
 * @{
 */

/********************************************************************//**
 * @brief		Initializes the I2Cx peripheral with specified parameter.
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	clockrate Target clock rate value to initialized I2C
 *              peripheral (Hz)
 * @return      None
 *********************************************************************/
    void I2C_Init( LPC_I2Cn_Type * I2Cx,
                   uint32_t clockrate )
    {
        uint32_t tem;

        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );

        if( I2Cx == LPC_I2C0 )
        {
            /* Set up clock for I2C0 module */
            /*LPC_CGU->BASE_VPB1_CLK = (SRC_PL160M_0<<24) | (1<<11); */
            CGU_EntityConnect( CGU_CLKSRC_PLL1, CGU_BASE_APB1 );

            /* Select weather standard, fast, fast plus mode*/
            if( clockrate >= 1000000 ) /* Fast mode plus: 1MHz, high speed 3.4MHz */
            {
                LPC_SCU->SFSI2C0 = SFSI2C0_CONFIGURE_FASTPLUS_HIGHSPEED_MODE;
            }
            else              /* standard 100KHz, fast 400KHz */
            {
                LPC_SCU->SFSI2C0 = SFSI2C0_CONFIGURE_STANDARD_FAST_MODE;
            }
        }
        else if( I2Cx == LPC_I2C1 )
        {
            /* Set up clock for I2C1 module */
            /*LPC_CGU->BASE_VPB3_CLK = (SRC_PL160M_0<<24) | (1<<11); */
            CGU_EntityConnect( CGU_CLKSRC_PLL1, CGU_BASE_APB3 );
            /* Configure pin function for I2C1*/
            LPC_SCU->SFSP2_3 = SFSP2_3_CONFIGURE_I2C1_SDA;      /* SDA */
            LPC_SCU->SFSP2_4 = SFSP2_4_CONFIGURE_I2C1_SCL;      /* SCL */

            /* Check if I2C1 run fast mode*/
            if( clockrate != 400000 )
            {
                return;
            }
        }
        else
        {
            /* Up-Support this device */
            return;
        }

        /* Set clock rate */
        if( clockrate < 1000 ) /*make sure SCLH,SCLL not exceed its 16bit value */
        {
            return;
        }

        tem = CGU_GetPCLKFrequency( CGU_PERIPHERAL_M3CORE ) / clockrate;
        I2Cx->SCLH = ( uint32_t ) ( tem / 2 );
        I2Cx->SCLL = ( uint32_t ) ( tem - I2Cx->SCLH );
        /* Set I2C operation to default */
        I2Cx->CONCLR = ( I2C_I2CONCLR_AAC | I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC | I2C_I2CONCLR_I2ENC );
    }


/*********************************************************************//**
 * @brief		De-initializes the I2C peripheral registers to their
 *                  default reset values.
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      None
 **********************************************************************/
    void I2C_DeInit( LPC_I2Cn_Type * I2Cx )
    {
        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );

        /* Disable I2C control */
        I2Cx->CONCLR = I2C_I2CONCLR_I2ENC;
    }


/*********************************************************************//**
 * @brief		Enable or disable I2C peripheral's operation
 * @param[in]	I2Cx I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	NewState New State of I2Cx peripheral's operation, should be:
 *                  - ENABLE	:enable I2C operation
 *                  - DISABLE	:disable I2C operation
 * @return      none
 **********************************************************************/
    void I2C_Cmd( LPC_I2Cn_Type * I2Cx,
                  FunctionalState NewState )
    {
        CHECK_PARAM( PARAM_FUNCTIONALSTATE( NewState ) );
        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );

        if( NewState == ENABLE )
        {
            I2Cx->CONSET = I2C_I2CONSET_I2EN;
        }
        else
        {
            I2Cx->CONCLR = I2C_I2CONCLR_I2ENC;
        }
    }


/*********************************************************************//**
 * @brief       Enable/Disable interrupt for I2C peripheral
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	NewState	New State of I2C peripheral interrupt in NVIC core
 *              should be:
 *                  - ENABLE: enable interrupt for this I2C peripheral
 *                  - DISABLE: disable interrupt for this I2C peripheral
 * @return      None
 **********************************************************************/
    void I2C_IntCmd( LPC_I2Cn_Type * I2Cx,
                     Bool NewState )
    {
        if( NewState )
        {
            if( I2Cx == LPC_I2C0 )
            {
                NVIC_EnableIRQ( I2C0_IRQn );
            }
            else if( I2Cx == LPC_I2C1 )
            {
                NVIC_EnableIRQ( I2C1_IRQn );
            }
        }
        else
        {
            if( I2Cx == LPC_I2C0 )
            {
                NVIC_DisableIRQ( I2C0_IRQn );
            }
            else if( I2Cx == LPC_I2C1 )
            {
                NVIC_DisableIRQ( I2C1_IRQn );
            }
        }
    }


/*********************************************************************//**
 * @brief       General Master Interrupt handler for I2C peripheral
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      None
 **********************************************************************/
    void I2C_MasterHandler( LPC_I2Cn_Type * I2Cx )
    {
        int32_t tmp;
        uint8_t returnCode;
        I2C_M_SETUP_Type * txrx_setup;

        tmp = I2C_getNum( I2Cx );
        txrx_setup = ( I2C_M_SETUP_Type * ) i2cdat[ tmp ].txrx_setup;

        returnCode = ( I2Cx->STAT & I2C_STAT_CODE_BITMASK );
        /* Save current status */
        txrx_setup->status = returnCode;

        /* there's no relevant information */
        if( returnCode == I2C_I2STAT_NO_INF )
        {
            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
            return;
        }

        /* ----------------------------- TRANSMIT PHASE --------------------------*/
        if( i2cdat[ tmp ].dir == 0 )
        {
            switch( returnCode )
            {
                /* A start/repeat start condition has been transmitted -------------------*/
                case I2C_I2STAT_M_TX_START:
                case I2C_I2STAT_M_TX_RESTART:
                    I2Cx->CONCLR = I2C_I2CONCLR_STAC;

