FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
                    /*
                     * If there's any transmit data, then start to
                     * send SLA+W right now, otherwise check whether if there's
                     * any receive data for next state.
                     */
                    if( ( txrx_setup->tx_data != NULL ) && ( txrx_setup->tx_length != 0 ) )
                    {
                        I2Cx->DAT = ( txrx_setup->sl_addr7bit << 1 );
                        I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                    }
                    else
                    {
                        goto next_stage;
                    }

                    break;

                /* SLA+W has been transmitted, ACK has been received ----------------------*/
                case I2C_I2STAT_M_TX_SLAW_ACK:
                /* Data has been transmitted, ACK has been received */
                case I2C_I2STAT_M_TX_DAT_ACK:

                    /* Send more data */
                    if( ( txrx_setup->tx_count < txrx_setup->tx_length ) && \
                        ( txrx_setup->tx_data != NULL ) )
                    {
                        I2Cx->DAT = *( uint8_t * ) ( txrx_setup->tx_data + txrx_setup->tx_count );
                        txrx_setup->tx_count++;
                        I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                    }
                    /* no more data, switch to next stage */
                    else
                    {
next_stage:
                        /* change direction */
                        i2cdat[ tmp ].dir = 1;

                        /* Check if any data to receive */
                        if( ( txrx_setup->rx_length != 0 ) && ( txrx_setup->rx_data != NULL ) )
                        {
                            /* check whether if we need to issue an repeat start */
                            if( ( txrx_setup->tx_length != 0 ) && ( txrx_setup->tx_data != NULL ) )
                            {
                                /* Send out an repeat start command */
                                I2Cx->CONSET = I2C_I2CONSET_STA;
                                I2Cx->CONCLR = I2C_I2CONCLR_AAC | I2C_I2CONCLR_SIC;
                            }
                            /* Don't need issue an repeat start, just goto send SLA+R */
                            else
                            {
                                goto send_slar;
                            }
                        }
                        /* no more data send, the go to end stage now */
                        else
                        {
                            /* success, goto end stage */
                            txrx_setup->status |= I2C_SETUP_STATUS_DONE;
                            goto end_stage;
                        }
                    }

                    break;

                /* SLA+W has been transmitted, NACK has been received ----------------------*/
                case I2C_I2STAT_M_TX_SLAW_NACK:
                /* Data has been transmitted, NACK has been received -----------------------*/
                case I2C_I2STAT_M_TX_DAT_NACK:
                    /* update status */
                    txrx_setup->status |= I2C_SETUP_STATUS_NOACKF;
                    goto retry;

                /* Arbitration lost in SLA+R/W or Data bytes -------------------------------*/
                case I2C_I2STAT_M_TX_ARB_LOST:
                    /* update status */
                    txrx_setup->status |= I2C_SETUP_STATUS_ARBF;

                default:
                    goto retry;
            }
        }

        /* ----------------------------- RECEIVE PHASE --------------------------*/
        else if( i2cdat[ tmp ].dir == 1 )
        {
            switch( returnCode )
            {
                /* A start/repeat start condition has been transmitted ---------------------*/
                case I2C_I2STAT_M_RX_START:
                case I2C_I2STAT_M_RX_RESTART:
                    I2Cx->CONCLR = I2C_I2CONCLR_STAC;

                    /*
                     * If there's any receive data, then start to
                     * send SLA+R right now, otherwise check whether if there's
                     * any receive data for end of state.
                     */
                    if( ( txrx_setup->rx_data != NULL ) && ( txrx_setup->rx_length != 0 ) )
                    {
send_slar:
                        I2Cx->DAT = ( txrx_setup->sl_addr7bit << 1 ) | 0x01;
                        I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                    }
                    else
                    {
                        /* Success, goto end stage */
                        txrx_setup->status |= I2C_SETUP_STATUS_DONE;
                        goto end_stage;
                    }

                    break;

                /* SLA+R has been transmitted, ACK has been received -----------------*/
                case I2C_I2STAT_M_RX_SLAR_ACK:

                    if( txrx_setup->rx_count < ( txrx_setup->rx_length - 1 ) )
                    {
                        /*Data will be received,  ACK will be return*/
                        I2Cx->CONSET = I2C_I2CONSET_AA;
                    }
                    else
                    {
                        /*Last data will be received,  NACK will be return*/
                        I2Cx->CONCLR = I2C_I2CONSET_AA;
                    }

                    I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                    break;

                /* Data has been received, ACK has been returned ----------------------*/
                case I2C_I2STAT_M_RX_DAT_ACK:

                    /* Note save data and increase counter first, then check later */
                    /* Save data  */
                    if( ( txrx_setup->rx_data != NULL ) && ( txrx_setup->rx_count < txrx_setup->rx_length ) )
                    {
                        *( uint8_t * ) ( txrx_setup->rx_data + txrx_setup->rx_count ) = ( I2Cx->DAT & I2C_I2DAT_BITMASK );
                        txrx_setup->rx_count++;
                    }

                    if( txrx_setup->rx_count < ( txrx_setup->rx_length - 1 ) )
                    {
                        /*Data will be received,  ACK will be return*/
                        I2Cx->CONSET = I2C_I2CONSET_AA;
                    }
                    else
                    {
                        /*Last data will be received,  NACK will be return*/
                        I2Cx->CONCLR = I2C_I2CONSET_AA;
                    }

                    I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                    break;

