FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
                /* Data has been received, NACK has been return -------------------------*/
                case I2C_I2STAT_M_RX_DAT_NACK:

                    /* Save the last data */
                    if( ( txrx_setup->rx_data != NULL ) && ( txrx_setup->rx_count < txrx_setup->rx_length ) )
                    {
                        *( uint8_t * ) ( txrx_setup->rx_data + txrx_setup->rx_count ) = ( I2Cx->DAT & I2C_I2DAT_BITMASK );
                        txrx_setup->rx_count++;
                    }

                    /* success, go to end stage */
                    txrx_setup->status |= I2C_SETUP_STATUS_DONE;
                    goto end_stage;

                /* SLA+R has been transmitted, NACK has been received ------------------*/
                case I2C_I2STAT_M_RX_SLAR_NACK:
                    /* update status */
                    txrx_setup->status |= I2C_SETUP_STATUS_NOACKF;
                    goto retry;

                /* Arbitration lost ----------------------------------------------------*/
                case I2C_I2STAT_M_RX_ARB_LOST:
                    /* update status */
                    txrx_setup->status |= I2C_SETUP_STATUS_ARBF;

                default:
retry:

                    /* check if retransmission is available */
                    if( txrx_setup->retransmissions_count < txrx_setup->retransmissions_max )
                    {
                        /* Clear tx count */
                        txrx_setup->tx_count = 0;
                        I2Cx->CONSET = I2C_I2CONSET_STA;
                        I2Cx->CONCLR = I2C_I2CONCLR_AAC | I2C_I2CONCLR_SIC;
                        txrx_setup->retransmissions_count++;
                    }
                    /* End of stage */
                    else
                    {
end_stage:
                        /* Disable interrupt */
                        I2C_IntCmd( I2Cx, FALSE );
                        /* Send stop */
                        I2C_Stop( I2Cx );

                        I2C_MasterComplete[ tmp ] = TRUE;
                    }

                    break;
            }
        }
    }


/*********************************************************************//**
 * @brief       General Slave Interrupt handler for I2C peripheral
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      None
 **********************************************************************/
    void I2C_SlaveHandler( LPC_I2Cn_Type * I2Cx )
    {
        int32_t tmp;
        uint8_t returnCode;
        I2C_S_SETUP_Type * txrx_setup;
        uint32_t timeout;

        tmp = I2C_getNum( I2Cx );
        txrx_setup = ( I2C_S_SETUP_Type * ) i2cdat[ tmp ].txrx_setup;

        returnCode = ( I2Cx->STAT & I2C_STAT_CODE_BITMASK );
        /* Save current status */
        txrx_setup->status = returnCode;

        /* there's no relevant information */
        if( returnCode == I2C_I2STAT_NO_INF )
        {
            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
            return;
        }

        switch( returnCode )
        {
            /* No status information */
            case I2C_I2STAT_NO_INF:
                I2Cx->CONSET = I2C_I2CONSET_AA;
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                break;

            /* Reading phase -------------------------------------------------------- */
            /* Own SLA+R has been received, ACK has been returned */
            case I2C_I2STAT_S_RX_SLAW_ACK:
            /* General call address has been received, ACK has been returned */
            case I2C_I2STAT_S_RX_GENCALL_ACK:
                I2Cx->CONSET = I2C_I2CONSET_AA;
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                break;

            /* Previously addressed with own SLA;
             * DATA byte has been received;
             * ACK has been returned */
            case I2C_I2STAT_S_RX_PRE_SLA_DAT_ACK:
            /* DATA has been received, ACK hasn been return */
            case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_ACK:

                /*
                 * All data bytes that over-flow the specified receive
                 * data length, just ignore them.
                 */
                if( ( txrx_setup->rx_count < txrx_setup->rx_length ) && \
                    ( txrx_setup->rx_data != NULL ) )
                {
                    *( uint8_t * ) ( txrx_setup->rx_data + txrx_setup->rx_count ) = ( uint8_t ) I2Cx->DAT;
                    txrx_setup->rx_count++;
                }

                I2Cx->CONSET = I2C_I2CONSET_AA;
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                break;

            /* Previously addressed with own SLA;
             * DATA byte has been received;
             * NOT ACK has been returned */
            case I2C_I2STAT_S_RX_PRE_SLA_DAT_NACK:
            /* DATA has been received, NOT ACK has been returned */
            case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_NACK:
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                break;

            /*
             * Note that: Return code only let us know a stop condition mixed
             * with a repeat start condition in the same code value.
             * So we should provide a time-out. In case this is really a stop
             * condition, this will return back after time out condition. Otherwise,
             * next session that is slave receive data will be completed.
             */

            /* A Stop or a repeat start condition */
            case I2C_I2STAT_S_RX_STA_STO_SLVREC_SLVTRX:
                /* Temporally lock the interrupt for timeout condition */
                I2C_IntCmd( I2Cx, FALSE );
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                /* enable time out */
                timeout = I2C_SLAVE_TIME_OUT;

                while( 1 )
                {
                    if( I2Cx->CONSET & I2C_I2CONSET_SI )
                    {
                        /* re-Enable interrupt */
                        I2C_IntCmd( I2Cx, TRUE );
                        break;
                    }
                    else
                    {
                        timeout--;

                        if( timeout == 0 )
                        {
                            /* timeout occur, it's really a stop condition */
                            txrx_setup->status |= I2C_SETUP_STATUS_DONE;
                            goto s_int_end;
                        }
                    }
                }

                break;

            /* Writing phase -------------------------------------------------------- */
            /* Own SLA+R has been received, ACK has been returned */
            case I2C_I2STAT_S_TX_SLAR_ACK:
            /* Data has been transmitted, ACK has been received */
            case I2C_I2STAT_S_TX_DAT_ACK:

