FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
                /*
                 * All data bytes that over-flow the specified receive
                 * data length, just ignore them.
                 */
                if( ( txrx_setup->tx_count < txrx_setup->tx_length ) && \
                    ( txrx_setup->tx_data != NULL ) )
                {
                    I2Cx->DAT = *( uint8_t * ) ( txrx_setup->tx_data + txrx_setup->tx_count );
                    txrx_setup->tx_count++;
                }

                I2Cx->CONSET = I2C_I2CONSET_AA;
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                break;

            /* Data has been transmitted, NACK has been received,
             * that means there's no more data to send, exit now */

            /*
             * Note: Don't wait for stop event since in slave transmit mode,
             * since there no proof lets us know when a stop signal has been received
             * on slave side.
             */
            case I2C_I2STAT_S_TX_DAT_NACK:
                I2Cx->CONSET = I2C_I2CONSET_AA;
                I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                txrx_setup->status |= I2C_SETUP_STATUS_DONE;
                goto s_int_end;

            /* Other status must be captured */
            default:
s_int_end:
                /* Disable interrupt */
                I2C_IntCmd( I2Cx, FALSE );
                I2Cx->CONCLR = I2C_I2CONCLR_AAC | I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC;
                I2C_SlaveComplete[ tmp ] = TRUE;
                break;
        }
    }


/*********************************************************************//**
 * @brief       Transmit and Receive data in master mode
 * @param[in]	I2Cx I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	TransferCfg	Pointer to a I2C_M_SETUP_Type structure that
 *              contains specified information about the configuration
 *              for master transfer.
 * @param[in]	Opt	a I2C_TRANSFER_OPT_Type type that selected for interrupt
 *              or polling mode.
 * @return      Transmit/receive status, should be:
 *                  - SUCCESS
 *                  - ERROR
 *
 * Note:
 * - In case of using I2C to transmit data only, either transmit length set to 0
 * or transmit data pointer set to NULL.
 * - In case of using I2C to receive data only, either receive length set to 0
 * or receive data pointer set to NULL.
 * - In case of using I2C to transmit followed by receive data, transmit length,
 * transmit data pointer, receive length and receive data pointer should be set
 * corresponding.
 **********************************************************************/
    Status I2C_MasterTransferData( LPC_I2Cn_Type * I2Cx,
                                   I2C_M_SETUP_Type * TransferCfg, \
                                   I2C_TRANSFER_OPT_Type Opt )
    {
        uint8_t * txdat;
        uint8_t * rxdat;
        uint32_t CodeStatus;
        uint8_t tmp;

        /* reset all default state */
        txdat = ( uint8_t * ) TransferCfg->tx_data;
        rxdat = ( uint8_t * ) TransferCfg->rx_data;
        /* Reset I2C setup value to default state */
        TransferCfg->tx_count = 0;
        TransferCfg->rx_count = 0;
        TransferCfg->status = 0;

        if( Opt == I2C_TRANSFER_POLLING )
        {
            /* First Start condition -------------------------------------------------------------- */
            TransferCfg->retransmissions_count = 0;
retry:
            /* reset all default state */
            txdat = ( uint8_t * ) TransferCfg->tx_data;
            rxdat = ( uint8_t * ) TransferCfg->rx_data;
            /* Reset I2C setup value to default state */
            TransferCfg->tx_count = 0;
            TransferCfg->rx_count = 0;
            CodeStatus = 0;

            /* Start command */
            CodeStatus = I2C_Start( I2Cx );

            if( ( CodeStatus != I2C_I2STAT_M_TX_START ) && \
                ( CodeStatus != I2C_I2STAT_M_TX_RESTART ) )
            {
                TransferCfg->retransmissions_count++;

                if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                {
                    /* save status */
                    TransferCfg->status = CodeStatus;
                    goto error;
                }
                else
                {
                    goto retry;
                }
            }

            /* In case of sending data first --------------------------------------------------- */
            if( ( TransferCfg->tx_length != 0 ) && ( TransferCfg->tx_data != NULL ) )
            {
                /* Send slave address + WR direction bit = 0 ----------------------------------- */
                CodeStatus = I2C_SendByte( I2Cx, ( TransferCfg->sl_addr7bit << 1 ) );

                if( CodeStatus != I2C_I2STAT_M_TX_SLAW_ACK )
                {
                    TransferCfg->retransmissions_count++;

                    if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                    {
                        /* save status */
                        TransferCfg->status = CodeStatus | I2C_SETUP_STATUS_NOACKF;
                        goto error;
                    }
                    else
                    {
                        goto retry;
                    }
                }

                /* Send a number of data bytes ---------------------------------------- */
                while( TransferCfg->tx_count < TransferCfg->tx_length )
                {
                    CodeStatus = I2C_SendByte( I2Cx, *txdat );

                    if( CodeStatus != I2C_I2STAT_M_TX_DAT_ACK )
                    {
                        TransferCfg->retransmissions_count++;

                        if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                        {
                            /* save status */
                            TransferCfg->status = CodeStatus | I2C_SETUP_STATUS_NOACKF;
                            goto error;
                        }
                        else
                        {
                            goto retry;
                        }
                    }

                    txdat++;
                    TransferCfg->tx_count++;
                }
            }

