FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
            /* Second Start condition (Repeat Start) ------------------------------------------- */
            if( ( TransferCfg->tx_length != 0 ) && ( TransferCfg->tx_data != NULL ) && \
                ( TransferCfg->rx_length != 0 ) && ( TransferCfg->rx_data != NULL ) )
            {
                CodeStatus = I2C_Start( I2Cx );

                if( ( CodeStatus != I2C_I2STAT_M_RX_START ) && \
                    ( CodeStatus != I2C_I2STAT_M_RX_RESTART ) )
                {
                    TransferCfg->retransmissions_count++;

                    if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                    {
                        /* Update status */
                        TransferCfg->status = CodeStatus;
                        goto error;
                    }
                    else
                    {
                        goto retry;
                    }
                }
            }

            /* Then, start reading after sending data -------------------------------------- */
            if( ( TransferCfg->rx_length != 0 ) && ( TransferCfg->rx_data != NULL ) )
            {
                /* Send slave address + RD direction bit = 1 ----------------------------------- */

                CodeStatus = I2C_SendByte( I2Cx, ( ( TransferCfg->sl_addr7bit << 1 ) | 0x01 ) );

                if( CodeStatus != I2C_I2STAT_M_RX_SLAR_ACK )
                {
                    TransferCfg->retransmissions_count++;

                    if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                    {
                        /* update status */
                        TransferCfg->status = CodeStatus | I2C_SETUP_STATUS_NOACKF;
                        goto error;
                    }
                    else
                    {
                        goto retry;
                    }
                }

                /* Receive a number of data bytes ------------------------------------------------- */
                while( TransferCfg->rx_count < TransferCfg->rx_length )
                {
                    /*
                     * Note that: if data length is only one, the master should not
                     * issue an ACK signal on bus after reading to avoid of next data frame
                     * on slave side
                     */
                    if( TransferCfg->rx_count < ( TransferCfg->rx_length - 1 ) )
                    {
                        /* Issue an ACK signal for next data frame */
                        CodeStatus = I2C_GetByte( I2Cx, &tmp, TRUE );

                        if( CodeStatus != I2C_I2STAT_M_RX_DAT_ACK )
                        {
                            TransferCfg->retransmissions_count++;

                            if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                            {
                                /* update status */
                                TransferCfg->status = CodeStatus;
                                goto error;
                            }
                            else
                            {
                                goto retry;
                            }
                        }
                    }
                    else
                    {
                        /* Do not issue an ACK signal */
                        CodeStatus = I2C_GetByte( I2Cx, &tmp, FALSE );

                        if( CodeStatus != I2C_I2STAT_M_RX_DAT_NACK )
                        {
                            TransferCfg->retransmissions_count++;

                            if( TransferCfg->retransmissions_count > TransferCfg->retransmissions_max )
                            {
                                /* update status */
                                TransferCfg->status = CodeStatus;
                                goto error;
                            }
                            else
                            {
                                goto retry;
                            }
                        }
                    }

                    *rxdat++ = tmp;
                    TransferCfg->rx_count++;
                }
            }

            /* Send STOP condition ------------------------------------------------- */
            I2C_Stop( I2Cx );
            return SUCCESS;

error:
            /* Send stop condition */
            I2C_Stop( I2Cx );
            return ERROR;
        }

        else if( Opt == I2C_TRANSFER_INTERRUPT )
        {
            /* Setup tx_rx data, callback and interrupt handler */
            tmp = I2C_getNum( I2Cx );
            i2cdat[ tmp ].txrx_setup = ( uint32_t ) TransferCfg;
            /* Set direction phase, write first */
            i2cdat[ tmp ].dir = 0;

            /* First Start condition -------------------------------------------------------------- */
            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
            I2Cx->CONSET = I2C_I2CONSET_STA;
            I2C_IntCmd( I2Cx, TRUE );

            return( SUCCESS );
        }

        return ERROR;
    }


/*********************************************************************//**
 * @brief       Receive and Transmit data in slave mode
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	TransferCfg		Pointer to a I2C_S_SETUP_Type structure that
 *              contains specified information about the configuration for
 *              master transfer.
 * @param[in]	Opt	I2C_TRANSFER_OPT_Type type that selected for interrupt
 *              or polling mode.
 * @return      Transmit/receive status, could be:
 *                  - SUCCESS
 *                  - ERRRO
 *
 * Note:
 * The mode of slave's operation depends on the command sent from master on
 * the I2C bus. If the master send a SLA+W command, this sub-routine will
 * use receive data length and receive data pointer. If the master send a SLA+R
 * command, this sub-routine will use transmit data length and transmit data
 * pointer.
 * If the master issue an repeat start command or a stop command, the slave will
 * enable an time out condition, during time out condition, if there's no activity
 * on I2C bus, the slave will exit, otherwise (i.e. the master send a SLA+R/W),
 * the slave then switch to relevant operation mode. The time out should be used
 * because the return status code can not show difference from stop and repeat
 * start command in slave operation.
 * In case of the expected data length from master is greater than data length
 * that slave can support:
 * - In case of reading operation (from master): slave will return I2C_I2DAT_IDLE_CHAR
 * value.
 * - In case of writing operation (from master): slave will ignore remain data from master.
 **********************************************************************/
    Status I2C_SlaveTransferData( LPC_I2Cn_Type * I2Cx,
                                  I2C_S_SETUP_Type * TransferCfg, \
                                  I2C_TRANSFER_OPT_Type Opt )
    {
        uint8_t * txdat;
        uint8_t * rxdat;
        uint32_t CodeStatus = 0;
        uint32_t timeout;
        int32_t time_en;
        int32_t tmp;

        /* reset all default state */
        txdat = ( uint8_t * ) TransferCfg->tx_data;
        rxdat = ( uint8_t * ) TransferCfg->rx_data;
        /* Reset I2C setup value to default state */
        TransferCfg->tx_count = 0;
        TransferCfg->rx_count = 0;
        TransferCfg->status = 0;

        /* Polling option */
        if( Opt == I2C_TRANSFER_POLLING )
        {
            /* Set AA bit to ACK command on I2C bus */
            I2Cx->CONSET = I2C_I2CONSET_AA;
            /* Clear SI bit to be ready ... */
            I2Cx->CONCLR = ( I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC );

            time_en = 0;
            timeout = 0;

            while( 1 )
            {
                /* Check SI flag ready */
                if( I2Cx->CONSET & I2C_I2CONSET_SI )
                {
                    time_en = 0;

