FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
                    switch( CodeStatus = ( I2Cx->STAT & I2C_STAT_CODE_BITMASK ) )
                    {
                        /* No status information */
                        case I2C_I2STAT_NO_INF:
                            I2Cx->CONSET = I2C_I2CONSET_AA;
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            break;

                        /* Reading phase -------------------------------------------------------- */
                        /* Own SLA+R has been received, ACK has been returned */
                        case I2C_I2STAT_S_RX_SLAW_ACK:
                        /* General call address has been received, ACK has been returned */
                        case I2C_I2STAT_S_RX_GENCALL_ACK:
                            I2Cx->CONSET = I2C_I2CONSET_AA;
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            break;

                        /* Previously addressed with own SLA;
                         * DATA byte has been received;
                         * ACK has been returned */
                        case I2C_I2STAT_S_RX_PRE_SLA_DAT_ACK:
                        /* DATA has been received, ACK hasn been return */
                        case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_ACK:

                            /*
                             * All data bytes that over-flow the specified receive
                             * data length, just ignore them.
                             */
                            if( ( TransferCfg->rx_count < TransferCfg->rx_length ) && \
                                ( TransferCfg->rx_data != NULL ) )
                            {
                                *rxdat++ = ( uint8_t ) I2Cx->DAT;
                                TransferCfg->rx_count++;
                            }

                            I2Cx->CONSET = I2C_I2CONSET_AA;
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            break;

                        /* Previously addressed with own SLA;
                         * DATA byte has been received;
                         * NOT ACK has been returned */
                        case I2C_I2STAT_S_RX_PRE_SLA_DAT_NACK:
                        /* DATA has been received, NOT ACK has been returned */
                        case I2C_I2STAT_S_RX_PRE_GENCALL_DAT_NACK:
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            break;

                        /*
                         * Note that: Return code only let us know a stop condition mixed
                         * with a repeat start condition in the same code value.
                         * So we should provide a time-out. In case this is really a stop
                         * condition, this will return back after time out condition. Otherwise,
                         * next session that is slave receive data will be completed.
                         */

                        /* A Stop or a repeat start condition */
                        case I2C_I2STAT_S_RX_STA_STO_SLVREC_SLVTRX:
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            /* enable time out */
                            time_en = 1;
                            timeout = 0;
                            break;

                        /* Writing phase -------------------------------------------------------- */
                        /* Own SLA+R has been received, ACK has been returned */
                        case I2C_I2STAT_S_TX_SLAR_ACK:
                        /* Data has been transmitted, ACK has been received */
                        case I2C_I2STAT_S_TX_DAT_ACK:

                            /*
                             * All data bytes that over-flow the specified receive
                             * data length, just ignore them.
                             */
                            if( ( TransferCfg->tx_count < TransferCfg->tx_length ) && \
                                ( TransferCfg->tx_data != NULL ) )
                            {
                                I2Cx->DAT = *txdat++;
                                TransferCfg->tx_count++;
                            }

                            I2Cx->CONSET = I2C_I2CONSET_AA;
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            break;

                        /* Data has been transmitted, NACK has been received,
                         * that means there's no more data to send, exit now */

                        /*
                         * Note: Don't wait for stop event since in slave transmit mode,
                         * since there no proof lets us know when a stop signal has been received
                         * on slave side.
                         */
                        case I2C_I2STAT_S_TX_DAT_NACK:
                            I2Cx->CONSET = I2C_I2CONSET_AA;
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            /* enable time out */
                            time_en = 1;
                            timeout = 0;
                            break;

                        /* Other status must be captured */
                        default:
                            I2Cx->CONCLR = I2C_I2CONCLR_SIC;
                            goto s_error;
                    }
                }
                else if( time_en )
                {
                    if( timeout++ > I2C_SLAVE_TIME_OUT )
                    {
                        /* it's really a stop condition, goto end stage */
                        goto s_end_stage;
                    }
                }
            }

s_end_stage:
            /* Clear AA bit to disable ACK on I2C bus */
            I2Cx->CONCLR = I2C_I2CONCLR_AAC;
            /* Check if there's no error during operation */
            /* Update status */
            TransferCfg->status = CodeStatus | I2C_SETUP_STATUS_DONE;
            return SUCCESS;

s_error:
            /* Clear AA bit to disable ACK on I2C bus */
            I2Cx->CONCLR = I2C_I2CONCLR_AAC;
            /* Update status */
            TransferCfg->status = CodeStatus;
            return ERROR;
        }

        else if( Opt == I2C_TRANSFER_INTERRUPT )
        {
            /* Setup tx_rx data, callback and interrupt handler */
            tmp = I2C_getNum( I2Cx );
            i2cdat[ tmp ].txrx_setup = ( uint32_t ) TransferCfg;
            /* Set direction phase, read first */
            i2cdat[ tmp ].dir = 1;

