FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_M0_LPC43xx_Keil/platform/M4_PeripheralLibraryFiles/lpc43xx_i2c.c
            /* Enable AA */
            I2Cx->CONSET = I2C_I2CONSET_AA;
            I2Cx->CONCLR = I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC;
            I2C_IntCmd( I2Cx, TRUE );

            return( SUCCESS );
        }

        return ERROR;
    }

/*********************************************************************//**
 * @brief		Set Own slave address in I2C peripheral corresponding to
 *              parameter specified in OwnSlaveAddrConfigStruct.
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	OwnSlaveAddrConfigStruct	Pointer to a I2C_OWNSLAVEADDR_CFG_Type
 *              structure that contains the configuration information for the
 *              specified I2C slave address.
 * @return      None
 **********************************************************************/
    void I2C_SetOwnSlaveAddr( LPC_I2Cn_Type * I2Cx,
                              I2C_OWNSLAVEADDR_CFG_Type * OwnSlaveAddrConfigStruct )
    {
        uint32_t tmp;

        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );
        CHECK_PARAM( PARAM_I2C_SLAVEADDR_CH( OwnSlaveAddrConfigStruct->SlaveAddrChannel ) );
        CHECK_PARAM( PARAM_FUNCTIONALSTATE( OwnSlaveAddrConfigStruct->GeneralCallState ) );

        tmp = ( ( ( uint32_t ) ( OwnSlaveAddrConfigStruct->SlaveAddr_7bit << 1 ) ) \
                | ( ( OwnSlaveAddrConfigStruct->GeneralCallState == ENABLE ) ? 0x01 : 0x00 ) ) & I2C_I2ADR_BITMASK;

        switch( OwnSlaveAddrConfigStruct->SlaveAddrChannel )
        {
            case 0:
                I2Cx->ADR0 = tmp;
                I2Cx->MASK[ 0 ] = I2C_I2MASK_MASK( ( uint32_t ) \
                                                   ( OwnSlaveAddrConfigStruct->SlaveAddrMaskValue ) );
                break;

            case 1:
                I2Cx->ADR1 = tmp;
                I2Cx->MASK[ 1 ] = I2C_I2MASK_MASK( ( uint32_t ) \
                                                   ( OwnSlaveAddrConfigStruct->SlaveAddrMaskValue ) );
                break;

            case 2:
                I2Cx->ADR2 = tmp;
                I2Cx->MASK[ 2 ] = I2C_I2MASK_MASK( ( uint32_t ) \
                                                   ( OwnSlaveAddrConfigStruct->SlaveAddrMaskValue ) );
                break;

            case 3:
                I2Cx->ADR3 = tmp;
                I2Cx->MASK[ 3 ] = I2C_I2MASK_MASK( ( uint32_t ) \
                                                   ( OwnSlaveAddrConfigStruct->SlaveAddrMaskValue ) );
                break;
        }
    }


/*********************************************************************//**
 * @brief		Configures functionality in I2C monitor mode
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	MonitorCfgType Monitor Configuration type, should be:
 *                  - I2C_MONITOR_CFG_SCL_OUTPUT	:I2C module can 'stretch'
 *              the clock line (hold it low) until it has had time to respond
 *              to an I2C interrupt.
 *                  - I2C_MONITOR_CFG_MATCHALL		:When this bit is set to '1'
 *              and the I2C is in monitor mode, an interrupt will be generated
 *              on ANY address received.
 * @param[in]	NewState New State of this function, should be:
 *                  - ENABLE	:Enable this function.
 *                  - DISABLE	:Disable this function.
 * @return		None
 **********************************************************************/
    void I2C_MonitorModeConfig( LPC_I2Cn_Type * I2Cx,
                                uint32_t MonitorCfgType,
                                FunctionalState NewState )
    {
        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );
        CHECK_PARAM( PARAM_I2C_MONITOR_CFG( MonitorCfgType ) );
        CHECK_PARAM( PARAM_FUNCTIONALSTATE( NewState ) );

        if( NewState == ENABLE )
        {
            I2Cx->MMCTRL |= MonitorCfgType;
        }
        else
        {
            I2Cx->MMCTRL &= ( ~MonitorCfgType ) & I2C_I2MMCTRL_BITMASK;
        }
    }


/*********************************************************************//**
 * @brief		Enable/Disable I2C monitor mode
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @param[in]	NewState New State of this function, should be:
 *                  - ENABLE	:Enable monitor mode.
 *                  - DISABLE	:Disable monitor mode.
 * @return		None
 **********************************************************************/
    void I2C_MonitorModeCmd( LPC_I2Cn_Type * I2Cx,
                             FunctionalState NewState )
    {
        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );
        CHECK_PARAM( PARAM_FUNCTIONALSTATE( NewState ) );

        if( NewState == ENABLE )
        {
            I2Cx->MMCTRL |= I2C_I2MMCTRL_MM_ENA;
            I2Cx->CONSET = I2C_I2CONSET_AA;
            I2Cx->CONCLR = I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC;
        }
        else
        {
            I2Cx->MMCTRL &= ( ~I2C_I2MMCTRL_MM_ENA ) & I2C_I2MMCTRL_BITMASK;
            I2Cx->CONCLR = I2C_I2CONCLR_SIC | I2C_I2CONCLR_STAC | I2C_I2CONCLR_AAC;
        }

        I2C_MonitorBufferIndex = 0;
    }


/*********************************************************************//**
 * @brief		Get data from I2C data buffer in monitor mode.
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return		None
 * Note:	In monitor mode, the I2C module may lose the ability to stretch
 * the clock (stall the bus) if the ENA_SCL bit is not set. This means that
 * the processor will have a limited amount of time to read the contents of
 * the data received on the bus. If the processor reads the I2DAT shift
 * register, as it ordinarily would, it could have only one bit-time to
 * respond to the interrupt before the received data is overwritten by
 * new data.
 **********************************************************************/
    uint8_t I2C_MonitorGetDatabuffer( LPC_I2Cn_Type * I2Cx )
    {
        CHECK_PARAM( PARAM_I2Cx( I2Cx ) );
        return( ( uint8_t ) ( I2Cx->DATA_BUFFER ) );
    }


/*********************************************************************//**
 * @brief		Get data from I2C data buffer in monitor mode.
 * @param[in]	I2Cx	I2C peripheral selected, should be
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return		None
 * Note:	In monitor mode, the I2C module may lose the ability to stretch
 * the clock (stall the bus) if the ENA_SCL bit is not set. This means that
 * the processor will have a limited amount of time to read the contents of
 * the data received on the bus. If the processor reads the I2DAT shift
 * register, as it ordinarily would, it could have only one bit-time to
 * respond to the interrupt before the received data is overwritten by
 * new data.
 **********************************************************************/
    BOOL_8 I2C_MonitorHandler( LPC_I2Cn_Type * I2Cx,
                               uint8_t * buffer,
                               uint32_t size )
    {
        BOOL_8 ret = FALSE;

        I2Cx->CONCLR = I2C_I2CONCLR_SIC;

        buffer[ I2C_MonitorBufferIndex ] = ( uint8_t ) ( I2Cx->DATA_BUFFER );
        I2C_MonitorBufferIndex++;

        if( I2C_MonitorBufferIndex >= size )
        {
            ret = TRUE;
        }

        return ret;
    }


/*********************************************************************//**
 * @brief       Get status of Master Transfer
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      Master transfer status, could be:
 *                  - TRUE		:master transfer completed
 *                  - FALSE     :master transfer have not completed yet
 **********************************************************************/
    uint32_t I2C_MasterTransferComplete( LPC_I2Cn_Type * I2Cx )
    {
        uint32_t retval, tmp;

        tmp = I2C_getNum( I2Cx );
        retval = I2C_MasterComplete[ tmp ];
        I2C_MasterComplete[ tmp ] = FALSE;
        return retval;
    }


/*********************************************************************//**
 * @brief       Get status of Slave Transfer
 * @param[in]	I2Cx	I2C peripheral selected, should be:
 *                  - LPC_I2C0	:I2C0 peripheral
 *                  - LPC_I2C1	:I2C1 peripheral
 * @return      Complete status, could be: TRUE/FALSE
 **********************************************************************/
    uint32_t I2C_SlaveTransferComplete( LPC_I2Cn_Type * I2Cx )
    {
        uint32_t retval, tmp;

        tmp = I2C_getNum( I2Cx );
        retval = I2C_SlaveComplete[ tmp ];
        I2C_SlaveComplete[ tmp ] = FALSE;
        return retval;
    }



/**
 * @}
 */

#endif /* _I2C */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
